Revit 2027 API
BuiltInFailures.GeneralFailures.DuplicateValue Property
 Elements have duplicate '[Value]' values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateValue { get; }
Public Shared ReadOnly Property DuplicateValue As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateValue {
	FailureDefinitionId^ get ();
}
static member DuplicateValue : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace